#include "source.h"

int instruction(void)
{
	//프로그램 소개 출력

	printf("\n\n\n\n\n*********************************************************************************************************************** \n\n");

	printf("안녕하세요~~ 저희는 눈송점메추 C프로그램을 제작한 눈송점메추조입니다!!\n");
	printf("눈송점메추는 바쁘지만 격렬하게 맛을 찾아 헤메고 있는 송이들을 위한 프로그램입니다~!\n");
	printf("여러 가지 기능들이 있으니 원하는 번호를 선택하고 잘 이용해주시길 바랍니다!\n");
	printf("모두모두 즐거운 점심 되세요~~\n");

	printf("\n\n\n\n(홈으로 돌아갑니다.)\n\n\n\n");

	int num_1;
	num_1 = home();

	return 0;
}


int all_place(void)
{
	//전체 음식점 출력

	printf("\n\n\n\n\n*********************************************************************************************************************** \n\n");

	int i;
	data();

	printf("\n<전체 음식점>\n\n\n");
	for (i = 1; i <= place_define_num; i++)
	{
		printf("%s\n", place_1[i]);
	}

	printf("\n\n\n\n(홈으로 돌아갑니다.)\n\n\n\n\n");

	int num_1;
	num_1 = home();

	return 0;
}


int all_menu(void)
{
	//전체 메뉴 출력

	printf("\n\n\n\n\n*********************************************************************************************************************** \n\n");

	int i;
	data();

	printf("\n<전체 메뉴> \n\n\n");

	for (i = 1; i <= menu_define_num; i++)
	{
		printf("%s\n", menu[i]);
	}

	printf("\n\n\n\n\n(홈으로 돌아갑니다.)\n\n\n\n\n");

	int num_1;
	num_1 = home();

	return 0;
}
